# 외부파라미터 구할 때만 씀
import numpy as np
import cv2

# 2D-image coordination
points_2D = np.array([ # 픽셀 좌표
    (322, 395),
    (380, 363),
    (302, 332),
    (288, 366),
    (240, 408),
    (484, 395),
    (485, 384),
    (451, 417)




], dtype="double")

# 픽셀값에 대응되는 라이다 포인트 좌표 (x,y,z)
points_3D = np.array([
    (0.9862692356109619, -0.07082690298557281, 0.19077491760253906),
    (1.4364759922027588, -0.348632276058197, 0.18005985021591187),
    (2.084094285964966, 0.011095177382230759, 0.18255439400672913),
    (1.3972387313842773, 0.0640314370393753, 0.17559751868247986),
    (0.8921400308609009, 0.21180647611618042, 0.1788311004638672),
    (1.0653460025787354, -0.5243656039237976, 0.18731936812400818),
    (1.0346829891204834, -0.5231558084487915, 0.2281283736228943),
    (0.9610131978988647, -0.3857938051223755, 0.13101623952388763)





], dtype="double")

# Camera Intrinsic Parameter
cameraMatrix = np.array([[978.01906392, 0, 617.53193012],
                [0, 976.10133873, 356.24646461],
                [0, 0, 1]])
'''
[[978.01906392   0.         617.53193012]
 [  0.         976.10133873 356.24646461]
 [  0.           0.           1.        ]]
'''

# 카메라 matrix의 왜곡 계수. 0으로 해도 무방.
dist_coeffs = np.array([0, 0, 0, 0, 0])

# using solvePnP to calculate R, t
retval, rvec, tvec = cv2.solvePnP(points_3D, points_2D, cameraMatrix,
                                  dist_coeffs, rvec=None, tvec=None, useExtrinsicGuess=None, flags=None)

rvec, _ = cv2.Rodrigues(rvec)
tvec = tvec

print('rvec :', rvec)
print('tvec :', tvec)